package com.company.HomeTask8;

import java.lang.reflect.Array;

public class ListOfQuestions {


    static String[] q1 = {
            "Столица Польши?", //вопрос
            "Варшава", // вариант 1
            "Минск", // вариант 2
            "Киев", // вариант 3
            "Прага", // вариант 4
            "1", // номер верного ответа

    };

    static String[] q2 = {
            "Столица Белоруссии?", //вопрос
            "Варшава", // вариант 1
            "Минск", // вариант 2
            "Киев", // вариант 3
            "Прага", // вариант 4
            "2", // номер верного ответа

    };

    static String[] q3 = {
            "Столица Украины?", //вопрос
            "Варшава", // вариант 1
            "Минск", // вариант 2
            "Киев", // вариант 3
            "Прага", // вариант 4
            "3", // номер верного ответа
    };
    static String[] q4 = {
            "Столица Чехии?", //вопрос
            "Варшава", // вариант 1
            "Минск", // вариант 2
            "Киев", // вариант 3
            "Прага", // вариант 4
            "4", // номер верного ответа
    };

    static String[] q5 = {
            "Столица Испании?", //вопрос
            "Мадрид", // вариант 1
            "Париж", // вариант 2
            "Токио", // вариант 3
            "Канбера", // вариант 4
            "1", // номер верного ответа

    };

    static String[] q6 = {
            "Столица Франции?", //вопрос
            "Мадрид", // вариант 1
            "Париж", // вариант 2
            "Токио", // вариант 3
            "Канбера", // вариант 4
            "2", // номер верного ответа

    };

    static String[] q7 = {
            "Столица Японии?", //вопрос
            "Мадрид", // вариант 1
            "Париж", // вариант 2
            "Токио", // вариант 3
            "Канбера", // вариант 4
            "3", // номер верного ответа

    };

    static String[] q8 = {
            "Столица Австралии?", //вопрос
            "Мадрид", // вариант 1
            "Париж", // вариант 2
            "Токио", // вариант 3
            "Канбера", // вариант 4
            "4", // номер верного ответа

    };

    static String[] q9 = {
            "Столица Португалии?", //вопрос
            "Лиссабон", // вариант 1
            "Италия", // вариант 2
            "Израиль", // вариант 3
            "Вена", // вариант 4
            "1", // номер верного ответа

    };

    static String[] q10 = {
            "Столица Италии?", //вопрос
            "Лиссабон", // вариант 1
            "Рим", // вариант 2
            "Тель-Авив", // вариант 3
            "Вена", // вариант 4
            "2", // номер верного ответа

    };


    public static String[][] listOfQuestions = {q1, q2, q3, q4, q5, q6, q7, q8, q9, q10};
}

